bog_app_4/app/controllers/creatures_controller.rb

SELECT "creatures".* FROM "creatures"
---
  def index
    @creatures = Creature.all

INSERT INTO "creatures" ("name", "description", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "ssss"], ["description", "sssss"], ["created_at", 2016-12-18 23:53:03 UTC], ["updated_at", 2016-12-18 23:53:03 UTC]]
---
  def create

    creature = Creature.new(creature_params)

    if creature.save

SELECT  "creatures".* FROM "creatures" WHERE "creatures"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def show

    creature_id = params[:id]
    @creature = Creature.find_by_id(creature_id)

SELECT  "creatures".* FROM "creatures" WHERE "creatures"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
---
  def edit
    creature_id = params[:id]
    @creature = Creature.find_by_id(creature_id)

SELECT  "creatures".* FROM "creatures" WHERE "creatures"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
UPDATE "creatures" SET "description" = $1, "updated_at" = $2 WHERE "creatures"."id" = $3  [["description", "sssssddddd"], ["updated_at", 2016-12-18 23:53:17 UTC], ["id", 3]]
---
  def update

    creature_id = params[:id]
    creature = Creature.find_by_id(creature_id)
    creature.update_attributes(creature_params)

SELECT  "creatures".* FROM "creatures" WHERE "creatures"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
DELETE FROM "creatures" WHERE "creatures"."id" = $1  [["id", 1]]
---
  def destroy
    creature_id = params[:id]
    creature = Creature.find_by_id(creature_id)
    creature.destroy