bog_app_3/app/controllers/creatures_controller.rb

  def index
    @creatures = Creature.all
---
SELECT "creatures".* FROM "creatures"

  def create
    creature_params = params.require(:creature).permit(:neam, :description)

    creature = Creature.new(creature_params)

    if creature.save
---
INSERT INTO "creatures" ("description", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["description", "yoyoyoyoyyo"], ["created_at", 2016-12-18 22:59:05 UTC], ["updated_at", 2016-12-18 22:59:05 UTC]]

  def show
    creature_id = params[:id]

    @creature = Creature.find_by_id(creature_id)
---
SELECT  "creatures".* FROM "creatures" WHERE "creatures"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

  def edit
    creature_id = params[:id]

    @creature = Creature.find_by_id(creature_id)
---
SELECT  "creatures".* FROM "creatures" WHERE "creatures"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

  def update
    creature_id = params[:id]

    creature = Creature.find_by_id(creature_id)

    creature.update_attributes(creature_params)
---
SELECT  "creatures".* FROM "creatures" WHERE "creatures"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "creatures" SET "description" = $1, "updated_at" = $2 WHERE "creatures"."id" = $3  [["description", "Jedisssss"], ["updated_at", 2016-12-18 23:00:03 UTC], ["id", 1]]

  def destroy
    creature_id = params[:id]

    creature = Creature.find_by_id(creature_id)

    creature.destroy
---
SELECT  "creatures".* FROM "creatures" WHERE "creatures"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
DELETE FROM "creatures" WHERE "creatures"."id" = $1  [["id", 3]]